# Задача №21. Решение в группах
# Напишите программу для печати всех уникальных
# значений в словаре.

# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# Примечание: Список словарей задан изначально.
# Пользователь его не вводит

spisok = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}] 

dict_2 = set( values for dict in spisok for values in dict.values())
print("УНИКАЛЬНЫЕ ЗНАЧЕНИЯ: ", dict_2)

#|||||||||||||||||||||||||||||||

#ИЛИ МОЖНО ТАК
#ТАК ПРОЩЕ

spisok = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
          {"VI": "S005"}, {"VII": "S005"}, {" V ": "S009"},
          {" VIII ": "S007"}]
result = list()
for dict in spisok:
    for k in dict:
        result.append(dict[k])
print(set(result))
